Вы пришли в отделение банка, в котором обслуживание ведется строго по талончикам, который Вы получаете в автомате при входе.
При регистрации, Вы обязательно указываете ФИО, год рождения, тип операции который Вам необходимо выполнить в отделении (например
Консультация, Получение денежных средств, Вложение средств, Открытие депозита, Коммунальные платежи).
После регистрации - вы получаете номер талончика, который генерируется строго по порядку.
По умолчанию, все клиенты обслуживаются в порядке возрастания номеров талончиков, но если есть клиенты, которые пришли выполнить
Вложение средств или Открытие депозита - они будут обслужены вне очереди.
Но начиная с определенного времени (например с 10 - 12 часов), без очереди обслуживаются люди пенсионного возраста (возраст более 65).
Создать множество, которое будет обслуживать класс Ticket.
Подумайте какой тип Set - а вы могли бы использовать для этой задачи и с помощью каких механизмов вы могли бы реализовать меняющиеся
условия работы обслуживания клиентов на протяжении рабочего дня.